# RadiusSymbolText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RadiusSymbolText Property
ParameterTypeId Class See Also
---
"Radius Symbol Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RadiusSymbolText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadiusSymbolText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RadiusSymbolText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace